#+BEGIN_COMMENT
.. title: NER: Pre-Processing the Data
.. slug: ner-pre-processing-the-data
.. date: 2021-01-13 16:43:13 UTC-08:00
.. tags: lstm,rnn,nlp,ner
.. category: NLP
.. link: 
.. description: Pre-processing the kaggle dataset.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-1f744d39-5ec7-43c3-aed3-2bff2bd4b574-ssh.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
** The Kaggle Data
#+begin_src python :results output :exports both
print(tabulate(data.iloc[:5], tablefmt="orgtbl", headers="keys"))
#+end_src   

#+RESULTS:
|    | Sentence #   | Word          | POS   | Tag   |
|----+--------------+---------------+-------+-------|
|  0 | Sentence: 1  | Thousands     | NNS   | O     |
|  1 | nan          | of            | IN    | O     |
|  2 | nan          | demonstrators | NNS   | O     |
|  3 | nan          | have          | VBP   | O     |
|  4 | nan          | marched       | VBN   | O     |

As you can (kind of) tell, the sentences are broken up so that each row has one word in it.

To make it easier to work with I'm going to rename the columns.

#+begin_src python :results none
data = data.rename(columns={"Sentence #":"sentence", "Word": "word", "Tag": "tag"})
#+end_src

** Words and Tags
   The first thing we're going to do is separate out the words to build our vocabulary. The =vocabulary= will be a mapping of each word to an index so that we can convert our text to numbers for our model. In addition we're going to add a =<PAD>= token so that if our input is to short we can pad it to be the right size. And an =UNK= token in case we don't know a word.

#+begin_src python :results none
token = namedtuple("Token", "pad unknown".split())
Token = token(pad="<PAD>", unknown="UNK")
#+end_src   

#+begin_src python :results output :exports both
vocabulary = {word: index for index, word in enumerate(data.word.unique())}
vocabulary[Token.pad] = len(vocabulary)
vocabulary[Token.unknown] = len(vocabulary)
print(f"{len(vocabulary):,}")
#+end_src

#+RESULTS:
: 35,180

We're going to do the same with the Tag column.

#+begin_src python :results output :exports both
tags = {tag: index for index, tag in enumerate(data.tag.unique())}
print(tags)
#+end_src

#+RESULTS:
: {'O': 0, 'B-geo': 1, 'B-gpe': 2, 'B-per': 3, 'I-geo': 4, 'B-org': 5, 'I-org': 6, 'B-tim': 7, 'B-art': 8, 'I-art': 9, 'I-per': 10, 'I-gpe': 11, 'I-tim': 12, 'B-nat': 13, 'B-eve': 14, 'I-eve': 15, 'I-nat': 16}

**Note:** This is actually cheating because I am using the whole dataset. Later on make sure to only use the training data.

** Sentences and Labels
   We're also going to need to smash the words back into sentences. There's probably a clever pandas way to do this, but I'll just brute-force it. We'll also need to join the labels for the sentences into strings.


#+begin_src python :results output :exports both
sentences = []
labels = []
sentence = None
for row in data.itertuples():
    if not pandas.isna(row.sentence):
        if sentence:
            sentences.append(sentence)
            labels.append(label)
        sentence = [row.word]
        label = [row.tag]
    else:
        sentence.append(row.word)
        label.append(row.tag)
print(f"{len(sentences):,}")
print(f"{len(labels):,}")
print(sentences[0])
print(labels[0])
#+end_src   

#+RESULTS:
: 47,958
: 47,958
: ['Thousands', 'of', 'demonstrators', 'have', 'marched', 'through', 'London', 'to', 'protest', 'the', 'war', 'in', 'Iraq', 'and', 'demand', 'the', 'withdrawal', 'of', 'British', 'troops', 'from', 'that', 'country', '.']
: ['O', 'O', 'O', 'O', 'O', 'O', 'B-geo', 'O', 'O', 'O', 'O', 'O', 'B-geo', 'O', 'O', 'O', 'O', 'O', 'B-gpe', 'O', 'O', 'O', 'O', 'O']

We're going to convert them to numbers so I didn't join them into strings.

** To Numbers

#+begin_src python :results output :exports both
sentence_vectors = [
    [vocabulary.get(word, Token.unknown) for word in sentence]
    for sentence in sentences
]

assert len(sentence_vectors) == len(sentences)
print(sentence_vectors[0])
#+end_src

#+RESULTS:
: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 9, 15, 1, 16, 17, 18, 19, 20, 21]


#+begin_src python :results output :exports both
label_vectors = [
    [tags[label] for label in sentence_labels] for sentence_labels in labels
]
assert len(label_vectors) == len(labels)
print(label_vectors[0])
#+end_src

#+RESULTS:
: [0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0]

In this case we're assuming that there's no unknown tags because they are only used for training and testing so we wouldn't expect to see one that isn't in our current dataset, unlike the sentences which are going to be used with new data and so might have tokens we haven't seen before.

We could add the padding here, but instead we're going to do it in the batch generator.

